ranjithaguna/pv/LED_Demo/source/pic32cx/component/espi_msvw00_06.h
#define ESPI_MSVW00_06_MSVW06_DW1_RESETVALUE (0x4040404U)                                  /**<  (ESPI_MSVW00_06_MSVW06_DW1) Master-to-Slave Virtual Wire 6 Register (DW 1)  Reset Value */

#define ESPI_MSVW00_06_MSVW06_DW1_SRC0_IRQ_SELECT_Pos (0)                                            /**< (ESPI_MSVW00_06_MSVW06_DW1) A change in the value of SRC0 will generate an interrupt to the EC. Changes in the SRC register value caused by a Reset Event\n      do not generate an interrupt. Position */
#define ESPI_MSVW00_06_MSVW06_DW1_SRC0_IRQ_SELECT_Msk (0xFU << ESPI_MSVW00_06_MSVW06_DW1_SRC0_IRQ_SELECT_Pos)  /**< (ESPI_MSVW00_06_MSVW06_DW1) A change in the value of SRC0 will generate an interrupt to the EC. Changes in the SRC register value caused by a Reset Event\n      do not generate an interrupt. Mask */
#define ESPI_MSVW00_06_MSVW06_DW1_SRC0_IRQ_SELECT(value) (ESPI_MSVW00_06_MSVW06_DW1_SRC0_IRQ_SELECT_Msk & ((value) << ESPI_MSVW00_06_MSVW06_DW1_SRC0_IRQ_SELECT_Pos))
#define ESPI_MSVW00_06_MSVW06_DW1_SRC1_IRQ_SELECT_Pos (8)                                            /**< (ESPI_MSVW00_06_MSVW06_DW1) A change in the value of SRC1 will generate an interrupt to the EC. Changes in the SRC register value caused by a Reset Event\n      do not generate an interrupt. Position */
#define ESPI_MSVW00_06_MSVW06_DW1_SRC1_IRQ_SELECT_Msk (0xFU << ESPI_MSVW00_06_MSVW06_DW1_SRC1_IRQ_SELECT_Pos)  /**< (ESPI_MSVW00_06_MSVW06_DW1) A change in the value of SRC1 will generate an interrupt to the EC. Changes in the SRC register value caused by a Reset Event\n      do not generate an interrupt. Mask */
#define ESPI_MSVW00_06_MSVW06_DW1_SRC1_IRQ_SELECT(value) (ESPI_MSVW00_06_MSVW06_DW1_SRC1_IRQ_SELECT_Msk & ((value) << ESPI_MSVW00_06_MSVW06_DW1_SRC1_IRQ_SELECT_Pos))
#define ESPI_MSVW00_06_MSVW06_DW1_SRC2_IRQ_SELECT_Pos (16)                                           /**< (ESPI_MSVW00_06_MSVW06_DW1) A change in the value of SRC2 will generate an interrupt to the EC. Changes in the SRC register value caused by a Reset Event\n      do not generate an interrupt. Position */
#define ESPI_MSVW00_06_MSVW06_DW1_SRC2_IRQ_SELECT_Msk (0xFU << ESPI_MSVW00_06_MSVW06_DW1_SRC2_IRQ_SELECT_Pos)  /**< (ESPI_MSVW00_06_MSVW06_DW1) A change in the value of SRC2 will generate an interrupt to the EC. Changes in the SRC register value caused by a Reset Event\n      do not generate an interrupt. Mask */
#define ESPI_MSVW00_06_MSVW06_DW1_SRC2_IRQ_SELECT(value) (ESPI_MSVW00_06_MSVW06_DW1_SRC2_IRQ_SELECT_Msk & ((value) << ESPI_MSVW00_06_MSVW06_DW1_SRC2_IRQ_SELECT_Pos))
#define ESPI_MSVW00_06_MSVW06_DW1_SRC3_IRQ_SELECT_Pos (24)                                           /**< (ESPI_MSVW00_06_MSVW06_DW1) A change in the value of SRC3 will generate an interrupt to the EC. Changes in the SRC register value caused by a Reset Event\n      do not generate an interrupt. Position */
#define ESPI_MSVW00_06_MSVW06_DW1_SRC3_IRQ_SELECT_Msk (0xFU << ESPI_MSVW00_06_MSVW06_DW1_SRC3_IRQ_SELECT_Pos)  /**< (ESPI_MSVW00_06_MSVW06_DW1) A change in the value of SRC3 will generate an interrupt to the EC. Changes in the SRC register value caused by a Reset Event\n      do not generate an interrupt. Mask */
#define ESPI_MSVW00_06_MSVW06_DW1_SRC3_IRQ_SELECT(value) (ESPI_MSVW00_06_MSVW06_DW1_SRC3_IRQ_SELECT_Msk & ((value) << ESPI_MSVW00_06_MSVW06_DW1_SRC3_IRQ_SELECT_Pos))
#define ESPI_MSVW00_06_MSVW06_DW1_Msk         (0x0F0F0F0FUL)                                 /**< (ESPI_MSVW00_06_MSVW06_DW1) Register Mask  */

/* -------- ESPI_MSVW00_06_MSVW06_DW2 : (ESPI_MSVW00_06 Offset: 0x50) (R/W 32) Master-to-Slave Virtual Wire 6 Register (DW 2) -------- */

typedef union
{
  struct
  {
    uint32_t SRC0:1;                    /**< bit:      0  Master-to-Slave data for Bit Position 0 for the virtual wire associated with the index defined by INDEX. */
    uint32_t :7;                        /**< bit:   1..7  Reserved                                      */
    uint32_t SRC1:1;                    /**< bit:      8  Master-to-Slave data for Bit Position 1 for the virtual wire associated with the index defined by INDEX. */
    uint32_t :7;                        /**< bit:  9..15  Reserved                                      */
    uint32_t SRC2:1;                    /**< bit:     16  Master-to-Slave data for Bit Position 2 for the virtual wire associated with the index defined by INDEX. */
    uint32_t :7;                        /**< bit: 17..23  Reserved                                      */
    uint32_t SRC3:1;                    /**< bit:     24  Master-to-Slave data for Bit Position 3 for the virtual wire associated with the index defined by INDEX. */
    uint32_t :7;                        /**< bit: 25..31  Reserved                                      */
  };
  struct
  {
    uint32_t SRC:4;                     /**< bit:   0..3  Master-to-Slave data for Bit Position 3 for the virtual wire associated with the index defined by INDEX. */
    uint32_t :28;                       /**< bit:  4..31  Reserved                                      */
  };
  uint32_t w;
} __ESPI_MSVW00_06_MSVW06_DW2_bits_t;
#define ESPI_MSVW00_06_MSVW06_DW2_RESETVALUE (0x00U)                                       /**<  (ESPI_MSVW00_06_MSVW06_DW2) Master-to-Slave Virtual Wire 6 Register (DW 2)  Reset Value */

#define ESPI_MSVW00_06_MSVW06_DW2_SRC0_Pos    (0)                                            /**< (ESPI_MSVW00_06_MSVW06_DW2) Master-to-Slave data for Bit Position 0 for the virtual wire associated with the index defined by INDEX. Position */
#define ESPI_MSVW00_06_MSVW06_DW2_SRC0_Msk    (0x1U << ESPI_MSVW00_06_MSVW06_DW2_SRC0_Pos)   /**< (ESPI_MSVW00_06_MSVW06_DW2) Master-to-Slave data for Bit Position 0 for the virtual wire associated with the index defined by INDEX. Mask */
#define ESPI_MSVW00_06_MSVW06_DW2_SRC1_Pos    (8)                                            /**< (ESPI_MSVW00_06_MSVW06_DW2) Master-to-Slave data for Bit Position 1 for the virtual wire associated with the index defined by INDEX. Position */
#define ESPI_MSVW00_06_MSVW06_DW2_SRC1_Msk    (0x1U << ESPI_MSVW00_06_MSVW06_DW2_SRC1_Pos)   /**< (ESPI_MSVW00_06_MSVW06_DW2) Master-to-Slave data for Bit Position 1 for the virtual wire associated with the index defined by INDEX. Mask */
#define ESPI_MSVW00_06_MSVW06_DW2_SRC2_Pos    (16)                                           /**< (ESPI_MSVW00_06_MSVW06_DW2) Master-to-Slave data for Bit Position 2 for the virtual wire associated with the index defined by INDEX. Position */
#define ESPI_MSVW00_06_MSVW06_DW2_SRC2_Msk    (0x1U << ESPI_MSVW00_06_MSVW06_DW2_SRC2_Pos)   /**< (ESPI_MSVW00_06_MSVW06_DW2) Master-to-Slave data for Bit Position 2 for the virtual wire associated with the index defined by INDEX. Mask */
#define ESPI_MSVW00_06_MSVW06_DW2_SRC3_Pos    (24)                                           /**< (ESPI_MSVW00_06_MSVW06_DW2) Master-to-Slave data for Bit Position 3 for the virtual wire associated with the index defined by INDEX. Position */
#define ESPI_MSVW00_06_MSVW06_DW2_SRC3_Msk    (0x1U << ESPI_MSVW00_06_MSVW06_DW2_SRC3_Pos)   /**< (ESPI_MSVW00_06_MSVW06_DW2) Master-to-Slave data for Bit Position 3 for the virtual wire associated with the index defined by INDEX. Mask */
#define ESPI_MSVW00_06_MSVW06_DW2_Msk         (0x01010101UL)                                 /**< (ESPI_MSVW00_06_MSVW06_DW2) Register Mask  */
#define ESPI_MSVW00_06_MSVW06_DW2_SRC_Pos     (0)                                            /**< (ESPI_MSVW00_06_MSVW06_DW2 Position) Master-to-Slave data for Bit Position 3 for the virtual wire associated with the index defined by INDEX. */
#define ESPI_MSVW00_06_MSVW06_DW2_SRC_Msk     (0xFU << ESPI_MSVW00_06_MSVW06_DW2_SRC_Pos)    /**< (ESPI_MSVW00_06_MSVW06_DW2 Mask) SRC */
#define ESPI_MSVW00_06_MSVW06_DW2_SRC(value)  (ESPI_MSVW00_06_MSVW06_DW2_SRC_Msk & ((value) << ESPI_MSVW00_06_MSVW06_DW2_SRC_Pos))

/** \brief ESPI_MSVW00_06 register offsets definitions */
#define ESPI_MSVW00_06_MSVW00_DW0_OFFSET (0x00)         /**< (ESPI_MSVW00_06_MSVW00_DW0) Master-to-Slave Virtual Wire 0 Register (DW 0) Offset */
#define ESPI_MSVW00_06_MSVW00_DW1_OFFSET (0x04)         /**< (ESPI_MSVW00_06_MSVW00_DW1) Master-to-Slave Virtual Wire 0 Register (DW 1) Offset */
#define ESPI_MSVW00_06_MSVW00_DW2_OFFSET (0x08)         /**< (ESPI_MSVW00_06_MSVW00_DW2) Master-to-Slave Virtual Wire 0 Register (DW 2) Offset */
#define ESPI_MSVW00_06_MSVW01_DW0_OFFSET (0x0C)         /**< (ESPI_MSVW00_06_MSVW01_DW0) Master-to-Slave Virtual Wire 1 Register (DW 0) Offset */
#define ESPI_MSVW00_06_MSVW01_DW1_OFFSET (0x10)         /**< (ESPI_MSVW00_06_MSVW01_DW1) Master-to-Slave Virtual Wire 1 Register  (DW 1) Offset */
#define ESPI_MSVW00_06_MSVW01_DW2_OFFSET (0x14)         /**< (ESPI_MSVW00_06_MSVW01_DW2) Master-to-Slave Virtual Wire 1 Register (DW 2) Offset */
#define ESPI_MSVW00_06_MSVW02_DW0_OFFSET (0x18)         /**< (ESPI_MSVW00_06_MSVW02_DW0) Master-to-Slave Virtual Wire 2 Register (DW 0) Offset */
#define ESPI_MSVW00_06_MSVW02_DW1_OFFSET (0x1C)         /**< (ESPI_MSVW00_06_MSVW02_DW1) Master-to-Slave Virtual Wire 2 Register (DW 1) Offset */
#define ESPI_MSVW00_06_MSVW02_DW2_OFFSET (0x20)         /**< (ESPI_MSVW00_06_MSVW02_DW2) Master-to-Slave Virtual Wire 2 Register (DW 2) Offset */
#define ESPI_MSVW00_06_MSVW03_DW0_OFFSET (0x24)         /**< (ESPI_MSVW00_06_MSVW03_DW0) Master-to-Slave Virtual Wire 3 Register (DW 0) Offset */
#define ESPI_MSVW00_06_MSVW03_DW1_OFFSET (0x28)         /**< (ESPI_MSVW00_06_MSVW03_DW1) Master-to-Slave Virtual Wire 3 Register (DW 1) Offset */
#define ESPI_MSVW00_06_MSVW03_DW2_OFFSET (0x2C)         /**< (ESPI_MSVW00_06_MSVW03_DW2) Master-to-Slave Virtual Wire 3 Register (DW 2) Offset */
#define ESPI_MSVW00_06_MSVW04_DW0_OFFSET (0x30)         /**< (ESPI_MSVW00_06_MSVW04_DW0) Master-to-Slave Virtual Wire 4 Register (DW 0) Offset */
#define ESPI_MSVW00_06_MSVW04_DW1_OFFSET (0x34)         /**< (ESPI_MSVW00_06_MSVW04_DW1) Master-to-Slave Virtual Wire 4 Register (DW 1) Offset */
#define ESPI_MSVW00_06_MSVW04_DW2_OFFSET (0x38)         /**< (ESPI_MSVW00_06_MSVW04_DW2) Master-to-Slave Virtual Wire 4 Register (DW 2) Offset */
#define ESPI_MSVW00_06_MSVW05_DW0_OFFSET (0x3C)         /**< (ESPI_MSVW00_06_MSVW05_DW0) Master-to-Slave Virtual Wire 5 Register (DW 0) Offset */
#define ESPI_MSVW00_06_MSVW05_DW1_OFFSET (0x40)         /**< (ESPI_MSVW00_06_MSVW05_DW1) Master-to-Slave Virtual Wire 5 Register (DW 1) Offset */
#define ESPI_MSVW00_06_MSVW05_DW2_OFFSET (0x44)         /**< (ESPI_MSVW00_06_MSVW05_DW2) Master-to-Slave Virtual Wire 5 Register (DW 2) Offset */
#define ESPI_MSVW00_06_MSVW06_DW0_OFFSET (0x48)         /**< (ESPI_MSVW00_06_MSVW06_DW0) Master-to-Slave Virtual Wire 6 Register (DW 0) Offset */
#define ESPI_MSVW00_06_MSVW06_DW1_OFFSET (0x4C)         /**< (ESPI_MSVW00_06_MSVW06_DW1) Master-to-Slave Virtual Wire 6 Register (DW 1) Offset */
#define ESPI_MSVW00_06_MSVW06_DW2_OFFSET (0x50)         /**< (ESPI_MSVW00_06_MSVW06_DW2) Master-to-Slave Virtual Wire 6 Register (DW 2) Offset */

