ranjithaguna/pv/LED_Demo/source/pic32cx/component/espi_msvw00_06.h
/** \brief ESPI_MSVW00_06 register API structure */
typedef struct
{  /* The Virtual Wire Channel permits the System to emulate a set of wires that interconnect the system Core Logic with the EC. */
  __IO  __ESPI_MSVW00_06_MSVW00_DW0_bits_t MSVW00_DW0;    /**< Offset: 0x00 (R/W  32) Master-to-Slave Virtual Wire 0 Register (DW 0) */
  __IO  __ESPI_MSVW00_06_MSVW00_DW1_bits_t MSVW00_DW1;    /**< Offset: 0x04 (R/W  32) Master-to-Slave Virtual Wire 0 Register (DW 1) */
  __IO  __ESPI_MSVW00_06_MSVW00_DW2_bits_t MSVW00_DW2;    /**< Offset: 0x08 (R/W  32) Master-to-Slave Virtual Wire 0 Register (DW 2) */
  __IO  __ESPI_MSVW00_06_MSVW01_DW0_bits_t MSVW01_DW0;    /**< Offset: 0x0C (R/W  32) Master-to-Slave Virtual Wire 1 Register (DW 0) */
  __IO  __ESPI_MSVW00_06_MSVW01_DW1_bits_t MSVW01_DW1;    /**< Offset: 0x10 (R/W  32) Master-to-Slave Virtual Wire 1 Register  (DW 1) */
  __IO  __ESPI_MSVW00_06_MSVW01_DW2_bits_t MSVW01_DW2;    /**< Offset: 0x14 (R/W  32) Master-to-Slave Virtual Wire 1 Register (DW 2) */
  __IO  __ESPI_MSVW00_06_MSVW02_DW0_bits_t MSVW02_DW0;    /**< Offset: 0x18 (R/W  32) Master-to-Slave Virtual Wire 2 Register (DW 0) */
  __IO  __ESPI_MSVW00_06_MSVW02_DW1_bits_t MSVW02_DW1;    /**< Offset: 0x1C (R/W  32) Master-to-Slave Virtual Wire 2 Register (DW 1) */
  __IO  __ESPI_MSVW00_06_MSVW02_DW2_bits_t MSVW02_DW2;    /**< Offset: 0x20 (R/W  32) Master-to-Slave Virtual Wire 2 Register (DW 2) */
  __IO  __ESPI_MSVW00_06_MSVW03_DW0_bits_t MSVW03_DW0;    /**< Offset: 0x24 (R/W  32) Master-to-Slave Virtual Wire 3 Register (DW 0) */
  __IO  __ESPI_MSVW00_06_MSVW03_DW1_bits_t MSVW03_DW1;    /**< Offset: 0x28 (R/W  32) Master-to-Slave Virtual Wire 3 Register (DW 1) */
  __IO  __ESPI_MSVW00_06_MSVW03_DW2_bits_t MSVW03_DW2;    /**< Offset: 0x2C (R/W  32) Master-to-Slave Virtual Wire 3 Register (DW 2) */
  __IO  __ESPI_MSVW00_06_MSVW04_DW0_bits_t MSVW04_DW0;    /**< Offset: 0x30 (R/W  32) Master-to-Slave Virtual Wire 4 Register (DW 0) */
  __IO  __ESPI_MSVW00_06_MSVW04_DW1_bits_t MSVW04_DW1;    /**< Offset: 0x34 (R/W  32) Master-to-Slave Virtual Wire 4 Register (DW 1) */
  __IO  __ESPI_MSVW00_06_MSVW04_DW2_bits_t MSVW04_DW2;    /**< Offset: 0x38 (R/W  32) Master-to-Slave Virtual Wire 4 Register (DW 2) */
  __IO  __ESPI_MSVW00_06_MSVW05_DW0_bits_t MSVW05_DW0;    /**< Offset: 0x3C (R/W  32) Master-to-Slave Virtual Wire 5 Register (DW 0) */
  __IO  __ESPI_MSVW00_06_MSVW05_DW1_bits_t MSVW05_DW1;    /**< Offset: 0x40 (R/W  32) Master-to-Slave Virtual Wire 5 Register (DW 1) */
  __IO  __ESPI_MSVW00_06_MSVW05_DW2_bits_t MSVW05_DW2;    /**< Offset: 0x44 (R/W  32) Master-to-Slave Virtual Wire 5 Register (DW 2) */
  __IO  __ESPI_MSVW00_06_MSVW06_DW0_bits_t MSVW06_DW0;    /**< Offset: 0x48 (R/W  32) Master-to-Slave Virtual Wire 6 Register (DW 0) */
  __IO  __ESPI_MSVW00_06_MSVW06_DW1_bits_t MSVW06_DW1;    /**< Offset: 0x4C (R/W  32) Master-to-Slave Virtual Wire 6 Register (DW 1) */
  __IO  __ESPI_MSVW00_06_MSVW06_DW2_bits_t MSVW06_DW2;    /**< Offset: 0x50 (R/W  32) Master-to-Slave Virtual Wire 6 Register (DW 2) */
} espimsvw0006_registers_t;
/** @}  end of The Virtual Wire Channel permits the System to emulate a set of wires that interconnect the system Core Logic with the EC. */

#endif /* _PIC32CX_0525SG12_ESPI_MSVW00_06_COMPONENT_H_ */
